In [2]:
import numpy as np
import pandas as pd

In [14]:
np.random.seed(101)
mydata = np.random.randint(0,101,(4,3))

In [15]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [16]:
myindex = ['CA','NY','AZ','TX']

In [17]:
mycolumns = ['Jan','Feb','Mar']

In [19]:
df = pd.DataFrame(data=mydata)
df

    0   1   2
0  95  11  81
1  70  63  87
2  75   9  77
3  40   4  63

In [21]:
df = pd.DataFrame(data=mydata, index=myindex, columns=mycolumns)
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [ ]:
# Where is my python code located?

In [23]:
pwd

'c:\\Users\\Alihdaya\\Your team Dropbox\\Elfrid Hasman\\Udemy Course\\Data Science & Machine Learning\\MyProject\\pandas'

In [24]:
ls

 Volume in drive C is Acer
 Volume Serial Number is 82E8-DE03

 Directory of c:\Users\Alihdaya\Your team Dropbox\Elfrid Hasman\Udemy Course\Data Science & Machine Learning\MyProject\pandas

10/27/2022  09:21 PM    <DIR>          .
10/27/2022  08:54 PM    <DIR>          ..
10/27/2022  08:42 PM               513 01-DataFrame.ipynb
10/27/2022  08:39 PM             5,008 01-Series.ipynb
10/25/2022  08:59 PM                51 example.csv
10/25/2022  08:59 PM             5,022 example.xlsx
10/25/2022  08:59 PM        25,112,317 hotel_booking_data.csv
10/25/2022  08:59 PM               177 movie_scores.csv
10/25/2022  08:59 PM            17,727 mpg.csv
10/25/2022  08:59 PM             5,022 my_excel_file.xlsx
10/25/2022  08:59 PM                51 new_file.csv
10/25/2022  08:59 PM             5,021 new_workbook.xlsx
10/25/2022  08:59 PM                51 newfile.csv
10/25/2022  08:59 PM             5,459 RetailSales_BeerWineLiquor.csv
10/25/2022  08:59 PM             1,320 Sales_Funnel_CRM.csv
10/25/2022  08:59 PM             1,330 sample_table.html
10/25/2022  08:59 PM               555 simple.html
10/25/2022  08:59 PM            18,752 tips.csv
              16 File(s)     25,178,376 bytes
               2 Dir(s)  19,069,644,800 bytes free

In [26]:
df = pd.read_csv('tips.csv')
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [27]:
df = pd.read_csv('c:\\Users\\Alihdaya\\Your team Dropbox\\Elfrid Hasman\\Udemy Course\\Data Science & Machine Learning\\MyProject\\pandas\\tips.csv')

In [28]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672